In [1]:
pip install pandas sqlalchemy pymysql

Requirement already satisfied: pandas in c:\users\harsi\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: sqlalchemy in c:\users\harsi\anaconda3\lib\site-packages (2.0.34)
Requirement already satisfied: pymysql in c:\users\harsi\anaconda3\lib\site-packages (1.1.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\harsi\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\harsi\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\harsi\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\harsi\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\harsi\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\harsi\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Requirement already satisfied: six>=1.5 in c:\users\harsi\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [1]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\harsi\anaconda3\lib\site-packages (1.1.2)

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from urllib.parse import quote_plus

In [5]:
import pandas as pd
from sqlalchemy import create_engine
from urllib.parse import quote_plus

# -------------------------
# 1. MYSQL CONNECTION
# -------------------------
user = "root"
raw_password = "Rani@2102"
password = quote_plus(raw_password)
host = "localhost"
port = 3306
database = "fleet_management"

connection_string = f"mysql+pymysql://{user}:{password}@{host}:{port}/{database}"
engine = create_engine(connection_string, echo=False)

print("MySQL connection created.\n")

MySQL connection created.

In [7]:
import os
print(os.listdir(r"C:\Users\harsi\Desktop\Projects\Fleet_Maintenance_Project"))

['Analysis Queries.sql', 'breakdown_events_medium_improved.csv', 'predicted_service_due_clean.xlsx', 'service_reminders_clean.xlsx', 'units_medium_improved.csv']

In [9]:
import pandas as pd

base_path = r"C:\Users\harsi\Desktop\Projects\Fleet_Maintenance_Project"

units_df = pd.read_csv(base_path + r"\units_medium_improved.csv")
service_df = pd.read_excel(base_path + r"\service_reminders_clean.xlsx")
predicted_df = pd.read_excel(base_path + r"\predicted_service_due_clean.xlsx")
breakdown_df = pd.read_csv(base_path + r"\breakdown_events_medium_improved.csv")

print("Files loaded successfully!")

Files loaded successfully!

In [13]:
units_df.head()

,unit_id,unit_number,unit_type,make,model,year,current_km,engine_hours,avg_km_per_day,status,primary_location
0,1,T2001,Tractor,Volvo,Reefer,2019,456787,8305,514,Active,Cambridge
1,2,T2002,Tractor,Utility,579,2015,231244,4204,447,Active,Milton
2,3,T2003,Tractor,Utility,VNL,2023,639898,11634,512,Spare,Hamilton
3,4,TR2004,Trailer,Volvo,VNL,2021,556778,10123,542,Active,Milton
4,5,TR2005,Trailer,Volvo,T680,2021,301414,5480,583,Spare,Hamilton

In [15]:
service_df.head()

   unit_id unit_number service_type service_status
0        1       T2001       A,B,AI        Overdue
1        2       T2002       A,B,AI        Overdue
2        3       T2003       A,B,AI        Overdue
3        4       T2004       A,B,AI        Overdue
4        5       T2005       A,B,AI        Overdue

In [17]:
predicted_df.head()

,unit_id,unit_number,predicted_due_date,km_projected_at_due,prediction_run_date,confidence,risk_level
0,1,T2001,2024-01-15,356000,2024-12-01,0.70,HIGH
1,2,T2002,2024-01-18,356250,2024-12-01,0.72,HIGH
2,3,T2003,2024-01-21,356500,2024-12-01,0.74,HIGH
3,4,T2004,2024-01-24,356750,2024-12-01,0.76,HIGH
4,5,T2005,2024-01-27,357000,2024-12-01,0.78,HIGH

In [19]:
breakdown_df.head()

,breakdown_id,unit_id,breakdown_date,failure_type,cause_category,cost_parts,cost_labour,total_cost,downtime_hours,was_preventable
0,1,30,2024-02-04,Suspension,Driver Abuse,1588.47,744.65,2333.11,9.5,True
1,2,30,2024-01-18,ABS,Wear & Tear,2755.78,634.27,3390.06,10.0,False
2,3,30,2024-03-11,ABS,Missed Service,1885.74,570.63,2456.37,4.3,True
3,4,5,2024-04-16,Cooling,Driver Abuse,2722.70,558.20,3280.91,9.6,True
4,5,38,2024-03-28,ABS,OEM Defect,1813.16,400.45,2213.61,7.9,True

In [23]:
# --------------------------------------------
# UPLOAD ALL 4 TABLES INTO MYSQL
# --------------------------------------------
units_df.to_sql("units_medium_improved", con=engine, if_exists='replace', index=False)
service_df.to_sql("service_reminders_clean", con=engine, if_exists='replace', index=False)
predicted_df.to_sql("predicted_service_due_clean", con=engine, if_exists='replace', index=False)
breakdown_df.to_sql("breakdown_events", con=engine, if_exists='replace', index=False)

print("All tables uploaded to MySQL!")

All tables uploaded to MySQL!